// # a_basic.js
// js 표준 스타일 ( 구글, 에어비엔비 규격을 따른다 )
// ? 1. 코드 들여쓰기
// : tab size 2 설정 (space 공백 2개가 tab 1개 )
// >> 괄호 내의 코드는 한칸 들여쓰기 등

// ? 2. 세미콜론으로 문장 구분(;)
// : 없어도 실행 가능 >> 반드시! 작성 권장!
// : 세미콜론의 역할 - 문장과 문장의 구분

// console.log(object) console.log(object)
// ? 3. 공백 사용 ( 가독성 )
// 예약어 (문법), 연산자, 값(데이터) 사이에는 공백을 사용

let num = 1; 
let sum = num + 10;
console.log(sum)

//! js 기본 용어
//? 1. 표현식 & 문장
// 1-1) 표현식
// : 연산식, 데이터, 함수 실행 등

// 3 + 5
// "안녕하세요"
// 7

//1-2) 문장
// : 세미콜론 단위로 나뉘어 지거나 하나 이상의 표현식이 모이는 경우 문장

//? 2. 키워드 & 식별자
// 2-1. 키워드(예약어)
// 2-2. 식별자 : 개발자가 각각의 데이터의 구분을 위해 붙인 특정 단어를 의미

//  +) 식별자 명명 규칙
// - 키워드 (예약어) 사용x
// - 숫자로 시작 x
// - 특수문자는 _(언더스코어) 또는 $(달러)만 허용 : 시작으로 언더 스코어 사용 권장 x
// - 공백 문자 허용 x


